In [1]:
#Series

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
#create two lists
labels=['a','b','c']
my_list=[10,20,30]

In [5]:
#Create a dictionary
d={'a':10,'b':20,'c':30}

In [6]:
print(labels)
print(my_list)
print(d)

['a', 'b', 'c']
[10, 20, 30]
{'a': 10, 'b': 20, 'c': 30}

In [8]:
#create a series
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [13]:
#Create series using numpy array
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [14]:
#Create a series using dictionary
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [16]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [19]:
ser1=pd.Series([1,2,3,4],['USA','JAPAN','ENGLAND','INDIA'])

In [21]:
#Get the location of the particular data
ser1['ENGLAND']

3

In [22]:
ser2=pd.Series([1,2,4,5],['USA','Germany','Italy','Japan'])

In [23]:
ser2

USA        1
Germany    2
Italy      4
Japan      5
dtype: int64

In [24]:
ser1+ser2

ENGLAND    NaN
Germany    NaN
INDIA      NaN
Italy      NaN
JAPAN      NaN
Japan      NaN
USA        2.0
dtype: float64

In [25]:
#Data Frame- part 1
from numpy.random import randn

In [32]:
np.random.seed(101)

In [33]:
#Create data frame using randn function

In [35]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [36]:
#Create a new column
df['new']=df['W']+df['Y']

In [37]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [38]:
#drop a column
df.drop('new',axis=1,inplace=True)

In [39]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [41]:
#drop a row
df.drop('C',axis=0,inplace=True)

In [42]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [43]:
#get the shape of the df data frame

In [44]:
df.shape

(4, 4)

In [45]:
#selecting Rows in the data frame based on a label
df.loc['D']

W   -0.497104
X   -0.754070
Y   -0.943406
Z    0.484752
Name: D, dtype: float64

In [46]:
#Selecting rows in the data frame based on an index
df.iloc[3]

W   -0.116773
X    1.901755
Y    0.238127
Z    1.996652
Name: E, dtype: float64

In [47]:
#Get subset of a data frame
df.loc['B','X']

0.39052784273374097

In [50]:
df.loc[['A','E'],['Y','W']]

          Y         W
A -1.706086  0.302665
E  0.238127 -0.116773

In [51]:
#conditions matches in Data Frame
df >0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
D  False  False  False   True
E  False   True   True   True

In [53]:
df[df<0]

          W        X         Y         Z
A       NaN      NaN -1.706086 -1.159119
B -0.134841      NaN       NaN       NaN
D -0.497104 -0.75407 -0.943406       NaN
E -0.116773      NaN       NaN       NaN

In [54]:
df[df['Z']<0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119

In [55]:
df[df['Z']>0]

          W         X         Y         Z
B -0.134841  0.390528  0.166905  0.184502
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [56]:
#Multiple conditions
df[(df['Z']<0) & (df['Y']<0)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119

In [57]:
#Reset Index
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     D -0.497104 -0.754070 -0.943406  0.484752
3     E -0.116773  1.901755  0.238127  1.996652

In [58]:
#Create an new index
newind='CO WT YX EQ'.split()

In [59]:
newind

['CO', 'WT', 'YX', 'EQ']

In [62]:
df['States']=newind

In [63]:
df

          W         X         Y         Z index States
A  0.302665  1.693723 -1.706086 -1.159119    CO     CO
B -0.134841  0.390528  0.166905  0.184502    WT     WT
D -0.497104 -0.754070 -0.943406  0.484752    YX     YX
E -0.116773  1.901755  0.238127  1.996652    EQ     EQ

In [64]:
#set States column as new index
df.set_index('States')

               W         X         Y         Z index
States
CO      0.302665  1.693723 -1.706086 -1.159119    CO
WT     -0.134841  0.390528  0.166905  0.184502    WT
YX     -0.497104 -0.754070 -0.943406  0.484752    YX
EQ     -0.116773  1.901755  0.238127  1.996652    EQ

In [65]:
#Multi Index and Index Hierachy

In [66]:
#Create lists

inside=[1,2,3,1,2,3]
outside=['G1','G2','G3','G1','G2','G3']

In [67]:
#make list to a tuple pairs
hier_index=list(zip(outside,inside))

In [68]:
hier_index

[('G1', 1), ('G2', 2), ('G3', 3), ('G1', 1), ('G2', 2), ('G3', 3)]

In [69]:
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [70]:
hier_index

MultiIndex([('G1', 1),
            ('G2', 2),
            ('G3', 3),
            ('G1', 1),
            ('G2', 2),
            ('G3', 3)],
           )

In [72]:
#Create a data frame using this index
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [73]:
df

             A         B
G1 1 -0.993263  0.196800
G2 2 -1.136645  0.000366
G3 3  1.025984 -0.156598
G1 1 -0.031579  0.649826
G2 2  2.154846 -0.610259
G3 3 -0.755325 -0.346419

In [74]:
#Accessing Data via multiple index
df.loc['G1']

          A         B
1 -0.993263  0.196800
1 -0.031579  0.649826

In [78]:
df.loc['G2'].loc[2]

          A         B
2 -1.136645  0.000366
2  2.154846 -0.610259

In [80]:
df.index.names=['Groups','Numbers']

In [81]:
df

                       A         B
Groups Numbers
G1     1       -0.993263  0.196800
G2     2       -1.136645  0.000366
G3     3        1.025984 -0.156598
G1     1       -0.031579  0.649826
G2     2        2.154846 -0.610259
G3     3       -0.755325 -0.346419

In [85]:
#To get the value in a particular location
df.loc['G3'].loc[3]['A']

Numbers
3    1.025984
3   -0.755325
Name: A, dtype: float64

In [86]:
#Access multiple index-cross section method
df.xs(1,level='Numbers')

               A         B
Groups
G1     -0.993263  0.196800
G1     -0.031579  0.649826

In [87]:
#Missing Data

In [88]:
d={'A':[1,2,np.nan],'B':[1,np.nan,np.nan],'C':[1,2,3]}

In [89]:
d

{'A': [1, 2, nan], 'B': [1, nan, nan], 'C': [1, 2, 3]}

In [90]:
df=pd.DataFrame(d)

In [91]:
df

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [92]:
#dropna()- Remove any row with one or more missing values
df.dropna()

     A    B  C
0  1.0  1.0  1

In [93]:
#dropna()- Remove any column with one or more missing values
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [94]:
#Drop rows with 2 n/a values 
df.dropna(thresh=2)

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2

In [97]:
#Drop columns with 1 n/a values 
df.dropna(axis=1,thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [98]:
#Fillna method
df.fillna(value=df['A'].mean())

     A    B  C
0  1.0  1.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [99]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64